# IsValidCableTrayType Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CableTray..::..IsValidCableTrayType Method
CableTray Class See Also
---
Identifies if a cable tray type is valid.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static bool IsValidCableTrayType(
	Document document,
	ElementId cabletrayType
)
```

Visual Basic
---
```text
Public Shared Function IsValidCableTrayType ( _
	document As Document, _
	cabletrayType As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidCableTrayType(
	Document^ document,
	ElementId^ cabletrayType
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
cabletrayType
    Type: Autodesk.Revit.DB..::..ElementId The cable tray type.
# ### Return Value
True if the cable tray type is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
CableTray Class
Autodesk.Revit.DB.Electrical Namespace